georgik/esp-idf-component-SDL/sdl/examples/snow/sdkconfig.defaults.esp32_s3_lcd_ev_board
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#

# Board selection
CONFIG_SDL_BSP_ESP32_S3_LCD_EV_BOARD=y

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Enable OCTAL PSRAM for large framebuffers (800x480 needs significant memory)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Required for large displays and TTF rendering
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# Enable touch support (ESP32-S3-LCD-EV-Board typically has touch)
CONFIG_SDL_BSP_TOUCH_ENABLE=y